### 4/6/2022

Below is a snippet from a table that contains information about employees that work at Company XYZ::  

| Column Name | Data Type | Example value | Description |
|:--|:--|:--|:--|
| employee_name	| string	| Cindy	| Name of employee |   
| employee_id	| integer	| 1837204	| unique id for each employee |   
| yrs_of_experience	| integer	| 14	| total working years of experience |  
| yrs_at_company	| integer	| 10	| total working years at Company XYZ | 
| compensation	| integer	| 100000	| dollar value of employee compensation | 
| career_track	| string	| technical	| potential values: technical, non-technical, executive |  


Company XYZ Human Resource department is trying to understand compensation across the company.  
    
**Pull the average, median, minimum, maximum, and standard deviations for salary across 5 year experience buckets at Company XYZ.**  I.e., get the corresponding average, median, minimum, maximum, and standard deviations for experience buckets 0-5, 5-10, 10-15, etc. You can assume the data is imported into a dataframe named `df`.  

$~$

In [1]:
import pandas as pd

In [2]:
# create a dictionary with some fake data
d = {
    'employee_name': ['Cindy', 'Bob', 'Dan', 'Pam'],
    'employee_id': [1837204, 1837205, 1837206, 1837207],
    'yrs_of_experience': [14, 10, 4, 20],
    'yrs_at_company': [10, 4, 4, 16],
    'compensation': [100000, 60000, 50000, 150000],
    'career_track': ['technical', 'non-technical', 'technical', 'executive']
}

In [3]:
# create a dataframe of the fake data
df = pd.DataFrame(d)

In [4]:
# create cut points for the 5-year experience bins, e.g., 0 up to but not including 5 years experience = [0, 5)
# the interval range ends at the max years of experience among the employees plus 5 to ensure everyone is binned
bins = pd.interval_range(start = 0, freq = 5, end = max(df['yrs_at_company'])+5, closed = 'left')

In [5]:
# add a variable to the dataframe corresponding to experience bin based on the above cut points
df['yrs_at_company_bin'] = pd.cut(df['yrs_at_company'], bins = bins)

In [6]:
# summary statistics for salary (compensation) for each experience bin group
salary_by_group = df.groupby('yrs_at_company_bin')['compensation'].describe().reset_index()

In [7]:
# round the standard deviation column to 2 decimal place digits
salary_by_group['std'] = salary_by_group['std'].round(2)

In [8]:
# select subset of columns (we don't need count, 25th, or 75th percentile)
salary_by_group  = salary_by_group [['yrs_at_company_bin', 'mean', 'std', '50%', 'min', 'max']]

In [9]:
# rename some columns
salary_by_group  = salary_by_group.rename({'yrs_at_company_bin':'years_experience', 'std':'stdev', '50%':'median'}, axis = 1)

In [10]:
salary_by_group

  years_experience      mean    stdev    median       min       max
0           [0, 5)   55000.0  7071.07   55000.0   50000.0   60000.0
1          [5, 10)       NaN      NaN       NaN       NaN       NaN
2         [10, 15)  100000.0      NaN  100000.0  100000.0  100000.0
3         [15, 20)  150000.0      NaN  150000.0  150000.0  150000.0